Repository: SalvatoreCapuozzo/Phi6-Final
Catalog: *.lproj/Localizable.strings
Languages: it

# kinematicLesson
source: Kinematics is the branch of classical mechanics which describes the motion of points (alternatively <<particles>>), bodies (objects), and systems of bodies without consideration of the masses of those objects nor the forces that may have caused the motion. Kinematics as a field of study is often referred to as the <<<geometry of motion>> and as such may be seen as a branch of mathematics. Kinematics begins with a description of the geometry of the system and the initial conditions of known values of the position, velocity and or acceleration of various points that are a part of the system, then from geometrical arguments it can determine the position, the velocity and the acceleration of any part of the system.
it: La cinematica (dal termine francese cinématique, coniato dal fisico André-Marie Ampère e derivato dal greco κίνημα -ατος, kinema -atos = «movimento», derivato a sua volta dal verbo κινέω, kineo = «muovo») è quel ramo della meccanica che si occupa di descrivere quantitativamente il moto dei corpi, indipendentemente dalle cause del moto stesso. È significativa la sua definizione di geometria del movimento: in effetti la cinematica del punto si può pensare come geometria dello spazio vettoriale quadridimensionale formato dalle tre coordinate spaziali e dalla coordinata temporale.

# kinematicTitle
source: Kinematics
it: Cinematica

# dynamicLesson
source: Dynamics is a branch of applied mathematics (specifically classical mechanics) concerned with the study of forces and torques and their effect on motion, as opposed to kinematics, which studies the motion of objects without reference to its causes. Isaac Newton defined the fundamental physical laws which govern dynamics in physics, especially his second law of motion. Generally speaking, researchers involved in dynamics study how a physical system might develop or alter over time and study the causes of those changes.
it: La dinamica è il ramo della meccanica che si occupa dello studio del moto dei corpi e delle sue cause o, in termini più concreti, delle circostanze che lo determinano e lo modificano. Lo studio completo della meccanica comprende anche la statica e la cinematica: la dinamica si differenzia dalla prima che studia le configurazioni di equilibrio meccanico, dalla seconda che studia, in astratto, tutti i moti concepibili ma non si occupa di determinare quali moti possono avvenire in un determinato contesto sperimentale.

# dynamicTitle
source: Dynamic
it: Dinamica

# staticsLesson
source: Statics is the branch of mechanics that is concerned with the analysis of loads (force and torque, or <<moment>>) acting on physical systems that do not experience an acceleration (a=0), but rather, are in static equilibrium with their environment. When in static equilibrium, the acceleration of the system is zero and the system is either at rest, or its center of mass moves at constant velocity.
it: In fisica la statica è la parte della meccanica che studia le condizioni di equilibrio di un corpo materiale, ovvero le condizioni necessarie affinché un corpo, inizialmente in quiete, resti in equilibrio anche dopo l'intervento di azioni esterne dette forze. Queste derivano dalla legge di conservazione della quantità di moto e dalla legge di conservazione del momento angolare.

# staticsTitle
source: Statics
it: Statica

# lesson00
source: • The location of the trajectory points successively occupied by the moving point is a continuous curve in space and is mathematically represented by the function • Space path and the extent of the progress made since the initial position P0. • Speed, variation in position along the trajectory as a function of time. • Acceleration. The study of how speed changes • Travel time from initial time often used as an independent variable, a function for which you express the other quantities • Rest is a special case of motion in which the coordinates remain constant and then speed and acceleration are zero. The concept of stillness and motion, yet a concept relevant to the intended reference system. Normally the trajectory of a particle in motion has a different shape and is mathematically represented by different unequazione in different reference systems.
it: • La traiettoria luogo dei punti occupati successivamente dal punto in movimento costituisce una curva continua nello spazio ed e’ rappresentata matematicamente dalla funzione • Spazio percorso e la misura del cammino percorso a partire dalla posizione iniziale P0. • Velocità, variazione di posizione lungo la traiettoria in funzione del tempo. • Accelerazione. Lo studio delle variazioni della velocità con il tempo introduce la grandezza • Tempo percorso dall istante iniziale spesso usato come variabile indipendente, in funzione di cui si esprimono le altre grandezze • La quiete è un caso particolare di moto in cui le coordinate restano costanti e quindi velocità e accelerazione sono nulle. Il concetto di quiete e di moto e tuttavia un concetto relativo al sistema di riferimento adottato. Di norma la traiettoria di una particella in moto ha una forma diversa ed è rappresentata matematicamente da unequazione diversa in diversi sistemi di riferimento.

# lesson01
source: Rectilinear motion • It takes place along a straight line on which an origin and a direction are arbitrarily chosen • The motion of the point is describable as a function of time through a single coordinate x (t), as represented in Figure 1.1 . The space varies from an initial position x0 and grows as a function of time, Mathematically, it is said that the space is a function of time and is denoted by x = x (t) • Experimentally x (t) can be determined by placing along the line of targets with a photodetector devices connected to a timer • get pairs of x and t values that make up the diagram in clockwise motion. x Time (t) diagram = -2m x (t) = -2 + 0.5 (t -3) 2 for 0 <t <3s for 3s <t <3s x (t) = +7 x (t) = 6- 2 (t -10) to 7s <t <10s to 10s <t <13s
it: Moto rettilineo • Si svolge lungo una retta sulla quale vengono fissati arbitrariamente un'origine e un verso • Il moto del punto è descrivibile in funzione del tempo tramite una sola coordinata x(t), come rappresentato in figura 1.1. Lo spazio varia a partire da un posizione iniziale x0 e cresce in funzione del tempo, Matematicamente, si dice che lo spazio e’ una funzione del tempo e si indica con x = x(t) • Sperimentalmente x(t) può essere determinata ponendo lungo la retta dei traguardi con dispositivi a cellula fotoelettrica collegati ad un cronometro • Si ottengono coppie di valori x e t che costituiscono il diagramma orario del moto. Diagramma orario x(t) = -2m x(t) = -2+0.5(t -3)2 per 0<t<3s per 3s<t<3s x(t) = +7 x(t) = 6-2(t –10) per 7s<t<10s per 10s<t<13s

# lesson02
source: Parabolic motion (motion of a projectile) • It has v0 when the velocity vector is oblique with respect to the acceleration vector g. • It's given by the superposition of two motions: • a rectilinear horizontal uniform motion; • and a rectilinear uniformly accelerated vertical motion. horizontal initial Speed y = - (1/2) (g / v0 ^ 2) x ^ 2 • v0 is the initial horizontal speed ; • g is the acceleration of gravity. • the trajectory of an object launched horizontally is a parabola with the vertex in the launching point.
it: Moto parabolico (moto di un proiettile) • Si ha quando il vettore velocità v0 è obliquo rispetto al vettore accelerazione g. • E' dato dalla sovrapposizione di due moti: • un moto rettilineo uniforme orizzontale; • e un modo rettilineo uniformemente accelerato verticale. Velocità iniziale orizzontale y = -(1/2)(g/v0^2)x^2 • v0 è la velocità iniziale orizzontale; • g è l'accelerazione di gravità. • La traiettoria di un oggetto lanciato in orizzontale è una parabola con il vertice nel punto di lancio.

# lesson10
source: Dynamics studies the motion of bodies in relation to the motion and its causes: why and how objects move. • The cause of motion is identified in the presence of interactions between bodies that manifest themselves as forces • The motion of bodies is determined by the Laws of Newton
it: • La Dinamica studia il moto dei corpi in relazione il moto con le sue cause: perche e come gli oggetti si muovono. • La causa del moto `e individuata nella presenza di interazioni fra corpi che si manifestano come Forze • Il moto dei corpi `e determinato dalle Leggi di Newton,Elemento

# lesson11
source: • Newton's First Law describes what happens in the absence of interactions • For an object who doesn't' interact with other objects, it's always possible to identify a reference system, called inertial, in which the object has zero acceleration. • in the absence of interaction with the outside world, an object persists in its state of rest or in constant motion, if viewed from an inertial reference system This is called the Principle of Inertia. If m indicates the mass of a body and the resultant F of the forces acting on it, Newton's law, also known as the fundamental law of dynamics, you write the following F = ma where a is the acceleration vector. • The previous equation must be considered as a definition of force acting on a material point. From its definition that the unit`a measurement of strength and kg m / s2, which is conventionally said newton, has symbol N.
it: • La prima legge di Newton descrive cosa succede in assenza di interazioni • Per un oggetto non interagente con altri oggetti, `e sempre possibile identificare un sistema di riferimento, detto inerziale, nel quale l’oggetto ha accelerazione nulla. • In assenza di interazioni con l’esterno, un oggetto permane nel suo stato di quiete o di moto a velocit`a costante, se osservato da un sistema di riferimento inerziale Nota anche come Principio di Inerzia. Se m indica la massa di un corpo e F la risultante delle forze agenti su di esso, la legge di Newton, nota anche come legge fondamentale della dinamica, si scrive nel modo seguente F = ma ove a e' il vettore accelerazione. • La precedente equazione va considerata come definizione di forza agente su di un punto materiale. Dalla sua definizione risulta che l’unit`a di misura della forza `e kg m/s2, che viene convenzionalmente detto newton, simbolo N.

# lesson20
source: An ideal point is an object with zero size (or rather insignificant compared to the size of the problem and therefore comparable to a material point) but with mass. The first law of motion states that: A material point perseveres in its state of rest or uniform rectilinear motion if the resultant of the forces applied on him is a zero vector (ie if the forces are opposed canceling) Σi (Fi) = 0 You must keep in mind that for the balance of a rigid body is not sufficient that the resultant of the forces is zero but also that the resultant of the moments of the applied forces is zero. In fact two equal and opposite forces, but applied at two non axial points create a non null moment. So next to the formula written above should be added: Σi (I) = 0 In case of general systems, which consist of several material points and several rigid bodies, the equilibrium criterion requires that each and every material point and each rigid body must be in balance. This means that, for a material system it is not sufficient to have the balance that the resultant of the external forces and the total moment of the external forces are zero. This is only a necessary condition.
it: Si chiama punto materiale un oggetto ideale con dimensioni nulle (o meglio trascurabili rispetto alle dimensioni dei fenomeni considerati e quindi paragonabile ad un punto materiale) ma dotato di massa. Il primo principio della dinamica afferma che: Un punto materiale persevera nel suo stato di quiete o di moto rettilineo uniforme se la risultante delle forze su di lui applicate è un vettore nullo(cioè se le forze si oppongono annullandosi) ∑i(Fi)=0 Bisogna tenere presente che per l'equilibrio di un corpo rigido non basta che il risultante delle forze sia nullo ma che anche il risultante dei momenti delle forze applicate sia nullo. In effetti due forze uguali ed opposte ma applicate in due punti del corpo non assiali creano un momento non nullo. Dunque accanto alla formula sopra scritta va aggiunta: ∑i(Mi)=0 Nel caso di sistemi generali, composti da diversi punti materiali e diversi corpi rigidi, il criterio di equilibrio necessita che ogni singolo punto materiale ed ogni singolo corpo rigido deve essere in equilibrio. Questo significa che per un sistema materiale non è sufficiente per avere l'equilibrio che il risultante delle forze esterne ed il momento totale delle forze esterne siano nulli. Questa è solo una condizione necessaria.

# lesson21
source: Reaction of the support and static friction In numerous simple problems, the reaction of the substrate is perpendicular to its surface. This is only true for a motionless object on a frictionless surface. Thus, for example, suppose that an object is resting on a inclined perfectly slippery floor (or a ball that can roll without resistors) and is held for a cable, then the reaction of the substrate is perfectly perpendicular to it. BUT the situation is different in the case of a motionless object on an inclined plane, without cable, retained solely by friction; the reaction R of the support compensates then only the weight. in this case, the reaction can be decomposed into a component perpendicular to the support Rn and a Rf parallel thereto. Rf is said force of static friction . !nother case in which the force is not perpendicular to the support: The intensity of the force of static friction is usually determined by means of the Coulomb theory, according to which the maximum component parallel to the contact surfaces is directly proportional to the intensity of the force exchanged between the same surfaces, using the coefficient of static friction. The static friction force (Fs) is given by the following formula: FS = us mg where us is the coefficient of static friction, and m and g are respectively the mass and the acceleration of gravity
it: Reazione del supporto e attrito statico In numerosi problemi semplici, la reazione del supporto è perpendicolare alla sua superficie. Questo è vero solo per un oggetto immobile su una superficie senza attrito. Così, per esempio, supponiamo un oggetto appoggiato su un piano inclinato perfettamente scivoloso (oppure una biglia che possa rotolare senza resistenze) e tenuto per un cavo, allora la reazione del supporto è perfettamente perpendicolare ad esso. Ma la situazione è diversa nel caso di un oggetto immobile su un piano inclinato, senza cavo, trattenuto unicamente dall'attrito; la reazione R del supporto compensa allora solo il peso. In questo caso, si può scomporre la reazione in una componente Rn perpendicolare al supporto e una Rf ad esso parallela. Rf è detta forza di attrito statico. Un altro caso in cui la forza non è perpendicolare al supporto: l'intensità della forza di attrito statico è determinata solitamente mediante la teoria di Coulomb, secondo la quale la massima componente parallela alle superfici di contatto è direttamente proporzionale all'intensità della forza scambiata tra le stesse superfici, mediante il coefficiente di attrito statico. La Forza d'attrito statico(Fs) è dato dalla seguente formula: Fs = us mg dove us è il coefficiente di attrito statico, ed m e g sono rispettivamente la massa dell'oggetto e l'accelerazione di gravità

# excercise00
source: Lesson 0
it: Lezione 0

# excercise01
source: Alberto and Biagio race on the 200-meter track. Alberto runs the race in 22 seconds, while Biagio runs it in 23.5 seconds Alberto starts 10 meters behind Biagio. Who will win the race?
it: Alberto e Biagio fanno una gara sui 200 metri piani. Si sa che Alberto corre in 22′′, mentre Biagio corre in 23′′,5. Alberto parte pero` 10 metri dietro a Biagio. Chi tagliera` per primo il traguardo?

# excercise02
source: A ball is thrown beyond the edge of the table with a velocity v = 0.6 m / s. The table is 1.25m tall. When does the ball land? At what distance?
it: Una biglia viene lanciata oltre il bordo del tavolo con una velocità v=0.6 m/s. Il tavolo è alto 1.25m. Quando atterra la biglia? A che distanza?

# solution00
source: Solution 0
it: Soluzione 0

# solution01
source: Alberto's' speed = 9.09 m / s Alberto crosses the finish line in 23.1s. Alberto wins the race.
it: Velocità Alberto = 9.09 m/s Alberto taglia il traguardo in 23.1s. Alberto Vince la gara.

# solution02
source: It lands in 0.5s It lands at a distance of 0.2m
it: Atterra in 0.5s Atterra ad una distanza di 0.2m

# excercise11
source: A body of mass m = 6.3 kg moves with uniform velocity v0 = 3.7 m / s when a force F = 54N starts acting on it in the same direction of motion but in opposite sense. Determine in how much time the body stops and how distance it has covered since the force has begun acting.
it: Un corpo di massa m = 6.3 kg si muove con velocità uniforme v0 = 3.7 m/s quando comincia ad agire su di esso una forza F di modulo F = 54 N nella direzione del moto ma in verso contrario. determinare il quanto tempo il corpo si ferma e quanto spazio percorre da quando é iniziata l’azione della forza.

# solution11
source: You can determine the acceleration of the body, that is constant and whose form and is a = F / m. The force has direction opposite to the motion, so it is a deceleration. The motion is therefore uniformly accelerated with negative acceleration. We choose zero as the moment that the force begins acting, so the law of motion and the law of speed become: x (t) = v0t - 1/2 at2, v ( t) = v0 - at From the second equation you get the instant t1 in which the body stops, that is, when its velocity is zero: t1 = v0 = mv0 = 0.43s. Substituting this result in the first equation you get the position after stopping and then the distance traveled: v02 MV02 x (t1) = 2a = 2F = 0.80m.
it: E' possibile determinare l’accelerazione del corpo, che risulta costante e il cui modulo e' a=F/m. La forza ha il verso opposto al moto e così anche l’accelerazione; quindi si tratta di una decelerazione. Il moto è dunque uniformemente accelerato con accelerazione negativa. Scegliendo come istante zero quello in cui comincia ad agire la forza, la legge del moto e la legge della velocità diventano: x(t) = v0t − 1/2 at2 , v(t) = v0 − at Dalla seconda si ottiene l’istante t1 in cui il corpo si ferma, cioè in cui la sua velocità è zero: t1=v0 =mv0 =0.43s. Sostituendo questo risultato nella prima si trova la posizione all’istante dell’arresto e quindi lo spazio percorso: v02 mv02 x(t1)=2a= 2F =0.80m.

# excercise20
source: Lesson 2
it: Lezione 2

# excercise21
source: You want to push a 150kg body, resting on the floor, with a force of 350N. Between the body and the floor there is a friction with a static friction coefficient of 0.3. Based on the force exerted, can you move the body ?
it: Si vuole spingere un corpo di 150kg fermo, appoggiato sul pavimento, con una forza di 350N. Tra il corpo ed il pavimento esiste un attrito con coefficiente di attrito statico pari a 0.3. In base alla forza esercitata, è possibile spostare il corpo?

# solution20
source: Solution 2
it: Soluzione 2

# solution21
source: To move the body it is necessary to impose a force exceeding the force of static friction. The static friction force is equal to: FS = us * m * a = 0.3 * 150kg * 9.8m / s ^ 2 = 441.45N. The force impressed on the body is equal to 350N, lower than the frictional force, by which the body does not move.
it: Per muovere il corpo è necessario imporre una forza superiore alla forza di attrito statico. La forza di attrito statico è pari a: Fs = us*m*a = 0.3*150kg*9.8m/s^2 = 441.45N. La forza impressa sul corpo è pari a 350N, inferiore alla forza di attrito, per cui il corpo non si muove.
